{
  "backend/main.mo": "Main actor for the MultiTiers app defining Player types (Tier, Category), CRUD operations for players (add, remove, update, search, filter), and user profile management, all gated by role-based access control (admin vs. user).",
  "backend/migration.mo": "Data migration module that upgrades the actor state from the old Player schema (without avatarUrl) to the new schema (with avatarUrl defaulting to null).",
  "feature_evidence.json": "Feature evidence report mapping three implemented features—Minecraft avatar auto-fetch in admin form, per-player remove buttons in admin panel, and avatar display in PlayerCard—to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of each frontend source file, describing their roles and notable changes such as avatar preview, remove player functionality, and UI polish.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for backgrounds, borders, charts, and sidebar.",
  "frontend/index.html": "Minimal HTML shell for the React app, setting the page title to 'MultiTiers' and mounting the app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (Home, Tier List, Leaderboard, Admin), wraps the app in QueryClientProvider and SearchProvider, and renders the shared Navbar/Footer layout.",
  "frontend/src/components/AdminModal.tsx": "Password-gated modal component for admin actions, containing an Add Player form with all tier/category options and a scrollable player list, without delete functionality.",
  "frontend/src/components/CategoryFilter.tsx": "Button-group component for filtering players by category, with active state styling (scale, glow) and hover effects for inactive options.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with the MultiTiers branding, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop/mobile nav links (Home, Tier List, Leaderboard), and a search input that calls an `onSearchChange` callback.",
  "frontend/src/components/PlayerCard.tsx": "Displays a single player's avatar, name, score, and tier badge as a styled card, with tier-specific colors defined in the exported `TIER_CONFIG` map.",
  "frontend/src/components/TierRow.tsx": "Renders a horizontal tier row with a colored tier label on the left and a grid of `PlayerCard` components (or an empty-state message) on the right.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing Internet Identity authentication state, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching players (all, by category, by tier, by search) and mutations for adding and removing players via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for the dark-mode color palette including ten tier-specific colors.",
  "frontend/src/lib/SearchContext.tsx": "Provides a simple React context (`SearchProvider` / `useSearch`) for sharing a global search term string across the component tree.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin management page with a password gate and UI for adding/removing players with tier and category selection.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section, tier breakdown stats, and top players with navigation to the tier list and leaderboard.",
  "frontend/src/pages/LeaderboardPage.tsx": "Leaderboard page that displays all players sorted by score with category filtering and search support.",
  "frontend/src/pages/TierListPage.tsx": "Tier list page that groups players by tier (HT1–LT5) with category filtering and search support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Barlow Condensed, Inter), OKLCH-based semantic color tokens (app, sidebar, tier palette), dark mode support, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for a Minecraft Tier List app, tracking existing features (skin avatar fetching, player removal, avatar display) and pending feature requests (backend avatar URL storage, admin panel CRUD, public tier list display)."
}