{
  "backend/main.mo": "Motoko actor defining a player registry with CRUD-like operations: stores players in a map with tier/category/score fields and exposes query/update methods for filtering, searching, and adding players.",
  "feature_evidence.json": "Feature evidence report mapping completed UI polish features (HomePage, TierListPage, LeaderboardPage, AdminModal, etc.) to their affected files, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of every frontend source file, serving as a quick reference for what each component, page, hook, and config file does.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell titled 'MultiTiers' that mounts the React app into a root div and loads the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (Home, Tier List, Leaderboard, Admin), wraps the app in QueryClientProvider and SearchProvider, and renders a shared Layout with Navbar and Footer.",
  "frontend/src/components/AdminModal.tsx": "Password-gated modal component for admin actions; includes a PasswordGate form with shake animation on failure, and an Add Player form with tier/category selects and a scrollable current-player list.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a row of filter buttons for all eight game categories plus an 'All' option, highlighting the active selection with a glowing tier-ht1 style and scale effect.",
  "frontend/src/components/Footer.tsx": "App footer displaying the MultiTiers brand, copyright year, and a caffeine.ai attribution link with a Heart icon styled in tier colors.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with logo, nav links (Home, Tier List, Leaderboard), a search input, and a mobile hamburger menu using TanStack Router for navigation.",
  "frontend/src/components/PlayerCard.tsx": "Displays a single player's avatar initial, name, score, and tier badge with tier-specific colors and glow styles; exports TIER_CONFIG for reuse.",
  "frontend/src/components/TierRow.tsx": "Renders a horizontal tier row with a colored tier label on the left and a wrapped grid of PlayerCards on the right, showing a placeholder when no players exist.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) via React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching players (all, by category, by tier, by search) and a mutation hook for adding a new player via the backend actor.",
  "frontend/src/index.css": "Global CSS defining Tailwind imports, CSS custom properties for app and tier colors using OKLCH, dark-mode variables, and utility classes for tier label gradients and glows.",
  "frontend/src/lib/SearchContext.tsx": "Simple React context providing a shared searchTerm string and setter, exposed via SearchProvider and useSearch hook.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Password-protected admin page that allows authenticated users to add players with tier, category, and score fields. Includes a password gate component with session storage persistence and a copy-link utility.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a hero section, tier breakdown stats grid, and top 3 players, with navigation buttons to the Tier List and Leaderboard pages and an admin modal trigger.",
  "frontend/src/pages/LeaderboardPage.tsx": "Leaderboard page that fetches all players, sorts them by score descending, and displays them in a ranked table with category filtering and real-time name search support.",
  "frontend/src/pages/TierListPage.tsx": "Tier List page that groups players into HT1–LT5 tiers, supports category filtering and name search, and renders each tier as a TierRow component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, an extended color palette with app semantic tokens and per-tier colors, dark mode, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot describing the MultiTiers app's architecture, existing features, known backend canister issue, and current development version (17)."
}