{
  "backend/main.mo": "Motoko actor defining the Player data model (with Tier and Category variants) and query/update functions for adding, retrieving, filtering, and searching players stored in a Map.",
  "feature_evidence.json": "Feature evidence report confirming that the Admin URL copyable element (using window.location.origin + '/admin' with a Copy button and 'Copied!' feedback) is implemented in AdminPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON map of concise per-file summaries for all frontend source files, describing each component's role and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties for colors, borders, and UI tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (/, /tier-list, /leaderboard, /admin), wraps the app in QueryClientProvider and SearchProvider, and renders the shared Layout with Navbar and Footer.",
  "frontend/src/components/CategoryFilter.tsx": "Reusable button-group component for filtering players by category, rendering 'All' plus all 8 category options with active highlighting using the tier-ht1 accent color.",
  "frontend/src/components/Footer.tsx": "App footer displaying the MultiTiers brand, current year copyright, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop nav links (Home, Tier List, Leaderboard), a search input, and a mobile hamburger menu.",
  "frontend/src/components/PlayerCard.tsx": "Player card component displaying avatar initial, name, score, and tier badge, with TIER_CONFIG defining colors and styles for all 10 tiers (LT5–HT1).",
  "frontend/src/components/TierRow.tsx": "Tier row layout component that renders a colored tier label on the left and a horizontal list of PlayerCards (or an empty-state message) on the right.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, persisting identity across page reloads via AuthClient, and exposes status flags and the current identity through a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching players (all, by category, by tier, by search term) and a mutation hook for adding a new player via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for the app's dark color scheme including tier-specific colors from LT5 to HT1.",
  "frontend/src/lib/SearchContext.tsx": "Provides a simple React context for sharing a search term string and its setter across the component tree.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page with a password-gated form that allows adding players with a specified name, tier, category, and score to the backend via the useAddPlayer mutation.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a hero section, per-tier player counts, and a top-3 leaderboard preview, with navigation links to the tier list and full leaderboard pages.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a ranked leaderboard table of all players sorted by score descending, with category filtering, real-time name search, medal icons for top 3, and tier badge per row.",
  "frontend/src/pages/TierListPage.tsx": "Displays players grouped into tier rows (HT1–LT5) with category filtering and real-time name search, rendering each tier via the TierRow component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, semantic app color tokens, tier color palette (LT5–HT1), border radius, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state for 'MultiTiers' (a Minecraft tier-ranking platform), recording schema version, feature list, architectural notes, and known issues across 13 iterations."
}