{
  "backend/main.mo": "Motoko actor defining a player registry with types for Tier, Category, and Player, plus query/update functions to add, retrieve, filter, and search players by tier, category, and name.",
  "feature_evidence.json": "Feature evidence report mapping three admin-related features (password-gated Admin page, Add Player form, and /admin route registration) to their implementation files and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's role in the app, covering routing, hooks, components, pages, and styles.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark CSS custom properties for theming (colors, radius, sidebar, charts) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with four routes (/, /tier-list, /leaderboard, /admin), wraps the app in QueryClientProvider and SearchProvider, and renders a shared Layout with Navbar and Footer.",
  "frontend/src/components/CategoryFilter.tsx": "Reusable button-group component for filtering players by category, rendering an 'All' option plus all 8 game categories with active-state styling using the tier-ht1 accent.",
  "frontend/src/components/Footer.tsx": "App footer displaying the MultiTiers brand, copyright year, and a caffeine.ai attribution link with UTM parameters.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with the MultiTiers logo, desktop nav links (Home, Tier List, Leaderboard), a search input, and a mobile hamburger menu.",
  "frontend/src/components/PlayerCard.tsx": "Renders a styled card for a single player showing their avatar initial, name, score, and tier badge, with tier-specific colors defined in the exported TIER_CONFIG map.",
  "frontend/src/components/TierRow.tsx": "Displays a horizontal row for a given tier with a colored tier label on the left and a wrapping grid of PlayerCard components (or an empty state message) on the right.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and expose the current identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching all players, players by tier, and searching players by name, plus a mutation hook for adding a new player via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind layers, defines CSS custom properties for app and tier colors in oklch, and adds tier-label utility classes with gradient backgrounds and glows.",
  "frontend/src/lib/SearchContext.tsx": "Defines a React context and provider for sharing a global search term string and its setter across the component tree.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page with a session-based password gate that, once authenticated, exposes a form to add new players with name, tier, category, and score fields using the useAddPlayer mutation.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section with navigation CTAs, a grid of tier counts per tier, and a top-3 players preview fetched via useGetAllPlayers.",
  "frontend/src/pages/LeaderboardPage.tsx": "Leaderboard page displaying all players sorted by score descending in a ranked table, with category filtering and real-time name search support.",
  "frontend/src/pages/TierListPage.tsx": "Tier List page grouping players into their respective tiers (LT5–HT1) using TierRow components, with category filtering and real-time name search.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, semantic app color tokens, tier color palette (LT5–HT1), border radius, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the MultiTiers app (MC Tiers-inspired ranking platform), its tier system, architectural notes, existing features, and current build version."
}