{
  "kind": "build_request",
  "title": "Add Minecraft skin auto-fetch and remove player to admin panel",
  "projectName": "MultiTiers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend player data model to store an optional Minecraft skin URL (or avatar URL) field alongside existing tier/category/score fields. Update addPlayer and any relevant query methods to include this field.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "when a player's Minecraft username to add them to the tier list, automatically fetch their Minecraft skin"
        ]
      },
      "acceptanceCriteria": [
        "The player record in the backend includes an optional avatarUrl field.",
        "addPlayer accepts and stores the avatarUrl.",
        "Existing query methods return the avatarUrl for each player."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the admin panel (AdminPage.tsx and/or AdminModal.tsx) so that when a Minecraft username is entered to add a player, the frontend automatically fetches the player's skin avatar using the Mojang API (https://mc-heads.net/avatar/{username} or equivalent public endpoint) and stores the resulting URL as the player's avatar. The avatar preview should be shown in the add-player form before submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "enter a player's Minecraft username to add them to the tier list — their skin will be automatically fetched via the Mojang API and displayed as their profile picture"
        ]
      },
      "acceptanceCriteria": [
        "Admin can type a Minecraft username in the add-player form.",
        "A preview of the player's Minecraft skin avatar is shown in the form (fetched from a public Mojang-compatible API like mc-heads.net).",
        "On submission, the avatar URL is sent to the backend and stored with the player record.",
        "If the username is invalid or the fetch fails, a clear error or fallback is shown."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a remove player button in the admin panel (AdminPage.tsx) next to each player in the current player list. Clicking it should delete that player from the backend and update the displayed list.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "add a way to remove players from the tier list",
          "remove player button on the admin panel to delete players from the tier list"
        ]
      },
      "acceptanceCriteria": [
        "Each player listed in the admin panel has a visible remove/delete button.",
        "Clicking the remove button calls a backend method to delete the player.",
        "The player list in the admin panel updates immediately after removal.",
        "The public tier list also no longer shows the removed player after refresh."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the PlayerCard component and TierRow/TierListPage to display each player's Minecraft skin avatar image (from the stored avatarUrl) as their profile picture instead of (or in addition to) the initial-based avatar. Fall back to the initial-based avatar if no avatarUrl is present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "The public-facing tier list will display players with their Minecraft skin avatars"
        ]
      },
      "acceptanceCriteria": [
        "PlayerCard displays the Minecraft skin avatar image when avatarUrl is available.",
        "If no avatarUrl is present, the existing initial-based fallback avatar is shown.",
        "Avatars are correctly sized and styled within the PlayerCard layout."
      ]
    }
  ],
  "constraints": [
    "All Motoko logic must remain in backend/main.mo (single-actor architecture).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Minecraft skin fetching must happen on the frontend using a public API (e.g., mc-heads.net) — do not proxy through the backend canister.",
    "Remove player functionality must only be accessible within the admin panel (password-gated)."
  ],
  "nonGoals": [
    "No user-uploaded skin images — only auto-fetch via Minecraft username.",
    "No authentication changes beyond the existing password gate.",
    "No changes to the Leaderboard page layout or logic.",
    "No real-time updates or WebSocket-based refresh."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}