{
  "kind": "build_request",
  "title": "Display copyable /admin URL on the Admin page",
  "projectName": "MultiTiers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "On the Admin page (`frontend/src/pages/AdminPage.tsx`), inside the management UI (visible after successful login), display the full current `/admin` URL as a copyable text element. Derive the URL dynamically using `window.location.origin + '/admin'`. Render it in a styled read-only input or code block accompanied by a 'Copy' button that copies the URL to the clipboard via the Clipboard API and shows a brief 'Copied!' confirmation feedback (e.g. for 2 seconds). This element should be clearly labelled, e.g. 'Admin URL'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "can you just make it so i can just copy and past",
          "it"
        ]
      },
      "acceptanceCriteria": [
        "The Admin management UI (post-login) displays a labelled 'Admin URL' section showing the full URL ending in /admin.",
        "The displayed URL is derived from window.location.origin + '/admin' so it works in both local and production environments.",
        "A 'Copy' button is present next to the URL.",
        "Clicking 'Copy' copies the URL to the clipboard using the Clipboard API.",
        "After clicking 'Copy', the button temporarily shows 'Copied!' feedback for approximately 2 seconds before reverting.",
        "The URL text is visually styled to stand out (e.g. monospace font, distinct background) consistent with the dark gaming theme.",
        "The element is only visible inside the authenticated admin management UI, not on the password gate screen."
      ]
    }
  ],
  "constraints": [
    "Do not modify any file under frontend/src/hooks/ (immutable paths).",
    "Do not add an Admin link to the Navbar.",
    "Keep all changes within AdminPage.tsx only."
  ],
  "nonGoals": [
    "Adding any new backend logic.",
    "Changing the password or authentication flow.",
    "Modifying any other page or component."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}