{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add password-protected Admin/Management area for player management",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Create password-protected Admin page at /admin route with authentication gate",
      "acceptanceCriteria": [
        "Navigating to /admin shows a password input gate before any management UI is visible.",
        "Entering the correct password (65515616151) grants access to the management area.",
        "Entering an incorrect password displays a visible error message and does not grant access.",
        "The authenticated session persists across in-page navigation (e.g. using sessionStorage) but not across full page reloads.",
        "A Logout button in the management area clears the session and returns to the password gate.",
        "The admin page follows the existing dark gaming visual theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "create",
          "description": "Create a new Admin page component that renders a full-screen password gate on initial load. The gate displays a centered card with a password input field and a 'Login' button. When the user submits the password '65515616151', store the authenticated state in sessionStorage and reveal the management UI. If the password is incorrect, show an inline error message. Include a 'Logout' button in the management UI that clears sessionStorage and returns to the password gate. Use the existing dark gaming visual theme with tier colors and shadcn-ui components (Card, Input, Button)."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add player management form in Admin UI with name, tier, category, and rating score inputs",
      "acceptanceCriteria": [
        "The Add Player form displays inputs for name, tier, category, and rating score.",
        "The tier dropdown lists all 10 tiers (LT5 through HT1).",
        "The category dropdown lists all 8 categories (Sword, Axe, Crystal, Mace, Spearmace, Diamond SMP, UHC, SMP).",
        "Submitting the form with valid data calls the backend addPlayer function.",
        "A success notification/message is displayed after a player is successfully added.",
        "The form fields are cleared after a successful submission.",
        "Validation prevents submission if any required field is empty.",
        "Added players immediately appear on the Tier List and Leaderboard pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Inside the authenticated management UI section of AdminPage, add an 'Add Player' form with four fields: Player Name (text input), Tier (select dropdown with all 10 tiers: LT5, HT5, LT4, HT4, LT3, HT3, LT2, HT2, LT1, HT1), Category (select dropdown with all 8 categories: Sword, Axe, Crystal, Mace, Spearmace, DiamondSMP, UHC, SMP matching the Category enum from backend.d.ts), and Rating Score (number input). Implement form validation to require all fields before submission. On form submission, call the backend addPlayer function using a React Query mutation (useMutation) that invokes actor.addPlayer(name, tier, score, category). Display a success notification after successful submission and clear all form fields. Invalidate the 'players' query after mutation success to refresh player lists across the app. Use shadcn-ui form components (Form, Input, Select, Button) and maintain the dark gaming visual theme."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useMutation hook for adding players. Export a useAddPlayer hook that returns a React Query mutation wrapping actor.addPlayer. The mutation should accept an object with name (string), tier (Tier enum), category (Category enum), and score (bigint) properties. Configure the mutation to invalidate the 'players' query key on success so that newly added players immediately appear in the Tier List and Leaderboard pages."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Register /admin route in TanStack Router without adding navigation link",
      "acceptanceCriteria": [
        "The route /admin is registered in the TanStack Router configuration in App.tsx.",
        "Navigating directly to /admin renders the AdminPage component.",
        "The Admin route does not appear in the main Navbar navigation links.",
        "All existing routes (Home, Tier List, Leaderboard) continue to work correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new /admin route in the TanStack Router configuration alongside the existing Home, Tier List, and Leaderboard routes. The route should render the AdminPage component. Do not modify the Navbar component or add any navigation links to the admin area. Ensure all existing routes continue to function correctly after adding the new route."
        }
      ]
    }
  ]
}