{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Minecraft skin auto-fetch and remove player to admin panel",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add Minecraft username input with automatic skin avatar fetch and preview in the admin add-player form",
      "acceptanceCriteria": [
        "Admin can type a Minecraft username in the add-player form.",
        "A preview of the player's Minecraft skin avatar is shown in the form (fetched from a public Mojang-compatible API like mc-heads.net).",
        "On submission, the avatar URL is sent to the backend and stored with the player record.",
        "If the username is invalid or the fetch fails, a clear error or fallback is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminModal.tsx",
          "operation": "modify",
          "description": "Add a Minecraft username input field to the add-player form. When the username is entered, automatically fetch the skin avatar from https://mc-heads.net/avatar/{username} and display it as a preview in the form. Store the fetched URL in component state and include it in the addPlayer mutation payload. Add error handling for invalid usernames or failed fetches with clear feedback to the user."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update the add-player form to include a Minecraft username input field. When the username is entered, automatically fetch the player's skin avatar from https://mc-heads.net/avatar/{username} and show a preview. On form submission, pass the fetched avatarUrl to the addPlayer backend method. Include validation and error handling for fetch failures."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useAddPlayer mutation to accept an optional avatarUrl parameter and pass it to the backend addPlayer method. Ensure the mutation payload includes avatarUrl when provided."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add remove player button to admin panel for deleting players from the tier list",
      "acceptanceCriteria": [
        "Each player listed in the admin panel has a visible remove/delete button.",
        "Clicking the remove button calls a backend method to delete the player.",
        "The player list in the admin panel updates immediately after removal.",
        "The public tier list also no longer shows the removed player after refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminModal.tsx",
          "operation": "modify",
          "description": "Add a remove/delete button next to each player in the scrollable current-player list within the admin modal. Wire the button to call the removePlayer backend method with the player's ID. Trigger a query invalidation after successful deletion to refresh the player list."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add a remove/delete button next to each player displayed in the admin panel's player list. Wire the button to call the removePlayer backend method with the player's ID. Invalidate the players query after successful removal to update the UI immediately."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useRemovePlayer mutation hook that calls the backend removePlayer method with a player ID. Configure the mutation to invalidate all player-related queries (allPlayers, playersByCategory, playersByTier) on success to ensure the UI updates across all pages."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display Minecraft skin avatar images in PlayerCard with fallback to initial-based avatar",
      "acceptanceCriteria": [
        "PlayerCard displays the Minecraft skin avatar image when avatarUrl is available.",
        "If no avatarUrl is present, the existing initial-based fallback avatar is shown.",
        "Avatars are correctly sized and styled within the PlayerCard layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PlayerCard.tsx",
          "operation": "modify",
          "description": "Update the PlayerCard component to display the player's Minecraft skin avatar image from the avatarUrl field when available. If avatarUrl is null or undefined, fall back to the existing initial-based avatar circle. Ensure the avatar image is properly sized, styled, and fits within the existing card layout with appropriate border-radius and tier-specific glow effects."
        }
      ]
    }
  ]
}